In [16]:
import pandas as pd

In [17]:
rates = pd.read_excel('baserate.xls', sheet_name='HISTORICAL SINCE 1694')

In [18]:
rates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1037 entries, 0 to 1036
Data columns (total 8 columns):
 #   Column                                                      Non-Null Count  Dtype
---  ------                                                      --------------  -----
 0   Unnamed: 0                                                  177 non-null    object
 1   Unnamed: 1                                                  837 non-null    object
 2   Unnamed: 2                                                  854 non-null    object
 3   Unnamed: 3                                                  849 non-null    object
 4   Unnamed: 4                                                  0 non-null      float64
 5   Unnamed: 5                                                  1 non-null      object
 6   Unnamed: 6                                                  0 non-null      float64
 7   CHANGES IN BANK RATE, MINIMUM LENDING RATE, MINIMUM BAND 1  1 non-null      object
dtypes: float64(2), object(6)
memory usage: 64.9+ KB

In [19]:
# Unnamed: 1 actually shows days, so we rename it to make it more accurate
rates.rename(columns = {'Unnamed: 1':'Day'}, inplace = True)

In [20]:
# What's in this db?
rates.info()
# because I can see the last 4 columns are basically empty, I will drop them later.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1037 entries, 0 to 1036
Data columns (total 8 columns):
 #   Column                                                      Non-Null Count  Dtype
---  ------                                                      --------------  -----
 0   Unnamed: 0                                                  177 non-null    object
 1   Day                                                         837 non-null    object
 2   Unnamed: 2                                                  854 non-null    object
 3   Unnamed: 3                                                  849 non-null    object
 4   Unnamed: 4                                                  0 non-null      float64
 5   Unnamed: 5                                                  1 non-null      object
 6   Unnamed: 6                                                  0 non-null      float64
 7   CHANGES IN BANK RATE, MINIMUM LENDING RATE, MINIMUM BAND 1  1 non-null      object
dtypes: float64(2), object(6)
memory usage: 64.9+ KB

In [21]:
# show me a random 20 to see if the column name has been changed and what other columns I need to modify.
rates.sample(n=20)

,Unnamed: 0,Day,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,"CHANGES IN BANK RATE, MINIMUM LENDING RATE, MINIMUM BAND 1"
100,NaN,24,Dec,8,NaN,NaN,NaN,NaN
269,NaN,24,July,4,NaN,NaN,NaN,NaN
283,1874,8,Jan,4,NaN,NaN,NaN,NaN
897,NaN,6,Aug,9.875,NaN,NaN,NaN,NaN
631,1932,18,Feb,5,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
84,NaN,29,May,5,NaN,NaN,NaN,NaN
266,NaN,12,Jun,6,NaN,NaN,NaN,NaN
878,1985,14,Jan,11.875,NaN,NaN,NaN,NaN
526,NaN,15,Aug,4.5,NaN,NaN,NaN,NaN
82,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
862,NaN,3,Oct,9.0625,NaN,NaN,NaN,NaN
713,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
463,NaN,24,Sep,3,NaN,NaN,NaN,NaN
115,1860,19,Jan,3,NaN,NaN,NaN,NaN
652,1954,13,May,3,NaN,NaN,NaN,NaN
647,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
874,NaN,5,Nov,10,NaN,NaN,NaN,NaN
595,1922,16,Feb,4.5,NaN,NaN,NaN,NaN
584,1918,no,changes,NaN,NaN,NaN,NaN,NaN

In [22]:
# Drop unnamed tables 4,5,6 and changes in bank rate as they are completely blank. 
rates.drop(['Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'CHANGES IN BANK RATE, MINIMUM LENDING RATE, MINIMUM BAND 1'], axis = 1, inplace = True)

In [23]:
# Rename the rest of unnamed columns so they are reflective of their values
rates.rename(columns = {'Unnamed: 0':'Year', 'Unnamed: 2':'Month', 'Unnamed: 3': 'Rates'}, inplace = True)

In [24]:
# Show me the changes
rates.head(15)
# we can see here that the first 6 rows do not contain any data, so we need to drop them.

         Year  Day Month Rates
0         NaN  NaN   NaN   NaN
1         NaN  NaN   NaN   NaN
2        Date  NaN   NaN   New
3   effective  NaN   NaN  rate
4         NaN  NaN   NaN     %
5   Bank Rate  NaN   NaN   NaN
6        1694  NaN   Oct     6
7         NaN  NaN   NaN   NaN
8        1695  NaN   Jan   4.5
9         NaN  NaN   May     3
10        NaN  NaN   NaN   NaN
11       1699  NaN  June   4.5
12        NaN  NaN   NaN   NaN
13       1716  NaN  July     4
14        NaN  NaN   NaN   NaN

In [25]:
rates = rates.drop([0,1,2,3,4,5])

In [26]:
# We make sure they have been taken out, which they have. Now, we notice we will need to reset their indeces. 
rates.head(15)

    Year  Day Month Rates
6   1694  NaN   Oct     6
7    NaN  NaN   NaN   NaN
8   1695  NaN   Jan   4.5
9    NaN  NaN   May     3
10   NaN  NaN   NaN   NaN
11  1699  NaN  June   4.5
12   NaN  NaN   NaN   NaN
13  1716  NaN  July     4
14   NaN  NaN   NaN   NaN
15  1719  NaN   Apr     5
16   NaN  NaN   NaN   NaN
17  1822  NaN  June     4
18   NaN  NaN   NaN   NaN
19  1825  NaN   Dec     5
20   NaN  NaN   NaN   NaN

In [27]:
# reset index for the whole dataframe. 
rates.reset_index()

      index  Year  Day Month Rates
0         6  1694  NaN   Oct     6
1         7   NaN  NaN   NaN   NaN
2         8  1695  NaN   Jan   4.5
3         9   NaN  NaN   May     3
4        10   NaN  NaN   NaN   NaN
...     ...   ...  ...   ...   ...
1026   1032   NaN  NaN   NaN   NaN
1027   1033  2023    2   Feb     4
1028   1034   NaN   23   Mar  4.25
1029   1035   NaN   11   May   4.5
1030   1036   NaN   22   Jun     5

[1031 rows x 5 columns]

In [28]:
rates.tail(16)

      Year  Day Month Rates
1021   NaN  NaN   NaN   NaN
1022  2021   16   Dec  0.25
1023   NaN  NaN   NaN   NaN
1024  2022    3   Feb   0.5
1025   NaN   17   Mar  0.75
1026   NaN    5   May     1
1027   NaN   16   Jun  1.25
1028   NaN    4   Aug  1.75
1029   NaN   22   Sep  2.25
1030   NaN    3   Nov     3
1031   NaN   15   Dec   3.5
1032   NaN  NaN   NaN   NaN
1033  2023    2   Feb     4
1034   NaN   23   Mar  4.25
1035   NaN   11   May   4.5
1036   NaN   22   Jun     5

In [29]:
# we try to get only the values where the year was at least 2007 but It throws an error, so we want to check dtypes. 
filtered_rates = rates[rates.Year > 2007]

TypeError: '>' not supported between instances of 'str' and 'int'

In [30]:
rates.dtypes
# we see that the previous code was not working because the year column is not an integer, neither are the day and rates (which should be a float).

Year     object
Day      object
Month    object
Rates    object
dtype: object

In [31]:
# we want to change the dtypes of the previous mentioned columns but we are getting an error indicating that this is not possible because there are null values. 
rates["Year"] = rates["Year"].astype("int")

ValueError: cannot convert float NaN to integer

In [32]:

# rates["Year"] = rates["Year"].astype("int")

# To avoid deleting data that will be valuable, we are going to ask Pandas to fill in the NaNS with the previous year up to a maximum of 12 (as the number of months in a year)
rates["Year"].fillna(method="bfill", limit=12, inplace=True)

In [33]:
# here we can see they have all filled with the previous year. We noticed there are more NaN values on the days, month and even rates columns. Since we only want rows with rates, we can drop the ones that do not have this info.

rates.sample(n=25)

                        Year  Day Month   Rates
457                     1894    5   Oct       3
604                     1925    5   Mar       5
617                     1930   31   Oct       6
453                     1894   10   Aug       4
459                     1894    1   Feb     2.5
596                     1923   13   Apr       4
926                     1992   12   Apr  11.875
798                     1980   13   Jun      14
667                     1959  NaN   NaN     NaN
686                     1965   23   Nov       7
375                     1886    7   May       3
44                      1848   21   Jan       4
699                     1968   21   Mar     7.5
454                     1894   24   Aug       5
254                     1873    9   Nov       7
806  Min.Band 1 Dealing Rate  NaN   NaN     NaN
825                      NaN   16   Apr  13.125
811                     1982   28   Oct  15.125
333                     1879   21   Nov       5
280                     1874    4   Dec       5
838                      NaN    4   Aug    11.5
862                     1984    3   Oct  9.0625
496                     1902   21   Feb       4
597                     1923   15   Jun     3.5
34                      1842  NaN   Apr       4

In [34]:
rates = rates.dropna(subset=["Rates"])

In [35]:
rates.sample(n=25)

      Year  Day Month    Rates
743   1976   10   Mar    10.25
808   1981   25   Aug  12.6875
782   1978   12   Sep      6.5
854   1983   12   Jan       11
896   1988    8   May    8.875
274   1874   14   Oct        6
137   1862    7   Nov        3
19    1825  NaN   Dec        5
824    NaN   10   Mar    13.25
90    1857   18   Dec        6
741   1976   10   Feb    10.75
755    NaN   26   Jan     10.5
555   1911   26   Jan        4
843   1983   26   Aug   10.875
452   1894    3   Aug        3
925   1992   22   Mar   12.375
921   1990    8   Oct   13.875
1035   NaN   11   May      4.5
142   1863   24  July        2
547   1911   10   Feb        3
264    NaN   17   May        6
883   1986   11   Jul   11.875
158   1864   20   Jan        8
581   1917   18   Jan      5.5
983   2004   10   Jul      3.5

In [36]:
# We need to check if there are anymore NaNs and where they are. 
# We need to check why there are still NaNs values in the year column.  
rates.isna().sum()

Year     62
Day      17
Month     0
Rates     0
dtype: int64

In [37]:
rows_with_nans = rates[rates["Year"].isna()]
rows_with_nans
# we can see that they have not been filled with the previous year because we put a limit of 12 assuming the rates were only changing once a month, but we can see here some months had more than one change.

     Year Day Month   Rates
159   NaN  11   Feb       7
160   NaN  25   Feb       6
161   NaN  16   Apr       7
175   NaN  26   Jan       5
176   NaN   2   Mar     4.5
...   ...  ..   ...     ...
841   NaN  24   Aug  11.125
865   NaN  14   Mar  8.5625
1034  NaN  23   Mar    4.25
1035  NaN  11   May     4.5
1036  NaN  22   Jun       5

[62 rows x 4 columns]

In [38]:
# so we try the same mothod as before but changing the limit
rates["Year"].fillna(method="bfill", limit=20, inplace=True)

In [40]:
# There are still 7 rows, as 20 is a significantly big number for a limit we dont want to keep increasing it. 7 rows is statistacally not significant, so we will drop these rows. 
rates.isna().sum()

Year      7
Day      17
Month     0
Rates     0
dtype: int64

In [41]:
rates = rates.dropna(subset=["Year"])

In [42]:
# We check again to make sure they have been dropped, and move on to analysing why there are 17 null values in the Day column. 
rates.isna().sum()

Year      0
Day      17
Month     0
Rates     0
dtype: int64

In [43]:
rows_with_nans_day = rates[rates["Day"].isna()]
rows_with_nans_day
# the missing values here are not very significant as we are assuming they only changed the rates once a month and as long as we have the month and rates, it will not make a difference. However, to make it cleaner we can fill them in with the median number of the Day column.

    Year  Day Month Rates
6   1694  NaN   Oct     6
8   1695  NaN   Jan   4.5
9   1699  NaN   May     3
11  1699  NaN  June   4.5
13  1716  NaN  July     4
15  1719  NaN   Apr     5
17  1822  NaN  June     4
19  1825  NaN   Dec     5
21  1827  NaN  July     4
23  1836  NaN  July   4.5
24  1838  NaN   Sep     5
26  1838  NaN   Feb     4
28  1839  NaN   May     5
29  1840  NaN   Jun   5.5
30  1840  NaN   Aug     6
32  1840  NaN   Jan     5
34  1842  NaN   Apr     4

In [44]:
day_median = rates.Day.median()
day_median

14.0

In [45]:
# Now we replace them with 14
rates["Day"].fillna(day_median, inplace=True)

In [46]:
# we can see they have all been filled now. 
rates.Day.isna().sum()

0

In [47]:
rates.sample(n=20)

      Year   Day Month   Rates
1011  2016     5   Mar     0.5
359   1884    15   Feb     3.5
26    1838  14.0   Feb       4
968   2000     8   Sep    5.25
507   1904     3   Sep       4
333   1879    21   Nov       5
1019  2020    11   Mar    0.25
238   1872     7   Oct       5
148   1864    23   Apr     3.5
85    1857    26  June     4.5
915   1989    25   May   13.75
665   1959    14   Aug     4.5
417   1891     6   Mar     4.5
297   1875     7   Jan       5
841   1983    24   Aug  11.125
116   1861    31   Jan       4
730   1974    13   Nov      13
127   1861     7   Jan       7
262   1874     7   May     4.5
626   1931    14   May     2.5

In [48]:
# Now we only want the entries from 2007 onwards. For this, we need to make sure the year column is an int, which is not.
rates.dtypes

Year     object
Day      object
Month    object
Rates    object
dtype: object

In [49]:
rates["Year"] = rates["Year"].astype("int")
# It flags up an error where one of the columns is using a range of dates, making it impossible to change to an int. Since this date is out of the range we are interested in analysing it, we can .

ValueError: invalid literal for int() with base 10: '1933-1938'

In [50]:

rates["Year"] = rates["Year"].astype("str")
range_rows = rates[rates["Year"].str.contains("-")]
# Drop the range rows
rates = rates.drop(range_rows.index)

In [51]:
rates["Year"] = rates["Year"].astype("int")
# We try to convert it to an int but there is a value (Repo Rate) that is not allowing us to do that. As this value is not benefitial, we will drop it.

ValueError: invalid literal for int() with base 10: 'Repo Rate'

In [52]:
# Remove the value 'Repo Rate' from the Year column
rates = rates.loc[rates["Year"] != "Repo Rate"]

In [53]:
# Convert the Year column to an integer dtype
rates["Year"] = rates["Year"].astype("int")

In [54]:
# Convert the column Day to int
rates["Day"] = rates["Day"].astype("int")

In [55]:
# Convert the rates column to a float 
rates["Rates"] = rates["Rates"].astype("float")

In [56]:
rates.dtypes

Year       int64
Day        int64
Month     object
Rates    float64
dtype: object

In [ ]:
rates = rates.reset_index(drop=True)

In [15]:
# now that the db looks like we want it to, we can export it to csv 
rates.to_csv('interest_rates_clean_all_years.csv')

In [ ]:
# Filter the DataFrame to get only the rows where the year is greater than or equal to 2007
# rates = rates[rates["Year"] >= 2007]

In [ ]:
rates.head()

      Year  Day Month  Rates
996   2007    9   Nov   5.00
998   2007   11   Jan   5.25
999   2008   10   May   5.50
1000  2008    5  July   5.75
1001  2008    6   Dec   5.50

In [ ]:
rates.tail()

      Year  Day Month  Rates
1028  2023    4   Aug   1.75
1029  2023   22   Sep   2.25
1030  2023    3   Nov   3.00
1031  2023   15   Dec   3.50
1033  2023    2   Feb   4.00

In [ ]:
# rates = rates.reset_index(drop=True)

In [ ]:
rates.head()

   Year  Day Month  Rates
0  2007    9   Nov   5.00
1  2007   11   Jan   5.25
2  2008   10   May   5.50
3  2008    5  July   5.75
4  2008    6   Dec   5.50

In [ ]:
# now that the db looks like we want it to, we can export it to csv 
# rates.to_csv('interest_rates_clean.csv')